Revit 2027 API
Document.GetCloudModelPath Method
 Gets the cloud model path of the cloud model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ModelPath GetCloudModelPath()
Public Function GetCloudModelPath As ModelPath
public:
ModelPath^ GetCloudModelPath()
member GetCloudModelPath : unit -> ModelPath
Return Value
ModelPath
 The cloud model path
Exceptions
Exception | Condition
InvalidOperationException |  This Document is a not cloud model, cannot execute this operation.
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace